// export const BACKGROUND_COLOR = {
//   "#FF0000": "#FFFFFF",
//   "#00FF00": "#000000",
//   "#0000FF": "#FFFFFF",
//   "#00FFFF": "#000000",
//   "#FF00FF": "#FFFFFF",
//   "#FFFF00": "#000000",
//   "#FFA500": "#000000",
//   "#800080": "#FFFFFF",
//   "#32CD32": "#000000",
//   "#40E0D0": "#000000",
//   "#FFC0CB": "#000000",
//   "#90EE90": "#000000",
//   "#ADD8E6": "#000000",
//   "#FFD700": "#000000",
//   "#808080": "#FFFFFF",
//   "#008080": "#FFFFFF",
//   "#00008B": "#FFFFFF",
//   "#FF1493": "#000000",
// }
export const BACKGROUND_COLOR: { [key: string]: string } = {
  "#FF0000": "#00FFFF", // Красный - Циан
  "#00FF00": "#FF00FF", // Зеленый - Магента
  "#0000FF": "#FFFF00", // Синий - Желтый
  "#FFFF00": "#0000FF", // Желтый - Синий
  "#FF00FF": "#00FF00", // Магента - Зеленый
  "#00FFFF": "#FF0000", // Циан - Красный
  "#FFA500": "#0055FF", // Оранжевый - Синий (яркий)
  "#800080": "#FFD700", // Пурпурный - Золотой
  "#02a102": "#FF4500", // Темно-зеленый - Оранжево-красный
  "#0000c2": "#FFFF99", // Темно-синий - Светло-желтый
}

// export const COLORS = [
//   "#FF0000", // Красный
//   "#00FF00", // Зеленый
//   "#0000FF", // Синий
//   "#FFFF00", // Желтый
//   "#FF00FF", // Магента
//   "#00FFFF", // Циан
//   "#FFA500", // Оранжевый
//   "#800080", // Пурпурный
//   "#02a102", // Темно-зеленый
//   "#0000c2", // Темно-синий
// ]
